Revit 2026 API

# FamilyThermalPropertiesFind Method

---

Finds the thermal properties by the 'id' property of a constructionType node in Constructions.xml.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static FamilyThermalProperties Find(
	Document pADoc,
	string constructionId
)
```
```vb
Public Shared Function Find (
	pADoc As Document,
	constructionId As String
) As FamilyThermalProperties
```
```cpp
public:
static FamilyThermalProperties^ Find(
	Document^ pADoc,
	String^ constructionId
)
```
```fsharp
static member Find :
        pADoc : Document *
        constructionId : string -> FamilyThermalProperties
```

#### Parameters

pADoc Document
     The document.
constructionId String
     The 'id' property of a constructionType node in Constructions.xml

#### Return Value

FamilyThermalProperties The thermal properties found, or  if no match was found.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

FamilyThermalProperties Class

Autodesk.Revit.DB Namespace